---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendRiseType
source: html/778e51c2-f5a1-eb8b-02c3-8e3549913074.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendRiseType Property

Symbol for a 1 line rise

## Syntax (C#)
```csharp
public RiseDropSymbol SingleLineBendRiseType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration